MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFF144/mcu.h
#define _ADCTRG1_TRGSRC3_POSITION                0x00000018
#define _ADCTRG1_TRGSRC3_MASK                    0x1F000000
#define _ADCTRG1_TRGSRC3_LENGTH                  0x00000005

#define _ADCTRG2_TRGSRC4_POSITION                0x00000000
#define _ADCTRG2_TRGSRC4_MASK                    0x0000001F
#define _ADCTRG2_TRGSRC4_LENGTH                  0x00000005

#define _ADCTRG2_TRGSRC5_POSITION                0x00000008
#define _ADCTRG2_TRGSRC5_MASK                    0x00001F00
#define _ADCTRG2_TRGSRC5_LENGTH                  0x00000005

#define _ADCTRG2_TRGSRC6_POSITION                0x00000010
#define _ADCTRG2_TRGSRC6_MASK                    0x001F0000
#define _ADCTRG2_TRGSRC6_LENGTH                  0x00000005

#define _ADCTRG2_TRGSRC7_POSITION                0x00000018
#define _ADCTRG2_TRGSRC7_MASK                    0x1F000000
#define _ADCTRG2_TRGSRC7_LENGTH                  0x00000005

#define _ADCTRG3_TRGSRC8_POSITION                0x00000000
#define _ADCTRG3_TRGSRC8_MASK                    0x0000001F
#define _ADCTRG3_TRGSRC8_LENGTH                  0x00000005

#define _ADCTRG3_TRGSRC9_POSITION                0x00000008
#define _ADCTRG3_TRGSRC9_MASK                    0x00001F00
#define _ADCTRG3_TRGSRC9_LENGTH                  0x00000005

#define _ADCTRG3_TRGSRC10_POSITION               0x00000010
#define _ADCTRG3_TRGSRC10_MASK                   0x001F0000
#define _ADCTRG3_TRGSRC10_LENGTH                 0x00000005

#define _ADCTRG3_TRGSRC11_POSITION               0x00000018
#define _ADCTRG3_TRGSRC11_MASK                   0x1F000000
#define _ADCTRG3_TRGSRC11_LENGTH                 0x00000005

#define _ADCCMPCON1_IELOLO_POSITION              0x00000000
#define _ADCCMPCON1_IELOLO_MASK                  0x00000001
#define _ADCCMPCON1_IELOLO_LENGTH                0x00000001

#define _ADCCMPCON1_IELOHI_POSITION              0x00000001
#define _ADCCMPCON1_IELOHI_MASK                  0x00000002
#define _ADCCMPCON1_IELOHI_LENGTH                0x00000001

#define _ADCCMPCON1_IEHILO_POSITION              0x00000002
#define _ADCCMPCON1_IEHILO_MASK                  0x00000004
#define _ADCCMPCON1_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON1_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON1_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON1_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON1_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON1_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON1_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON1_DCMPED_POSITION              0x00000005
#define _ADCCMPCON1_DCMPED_MASK                  0x00000020
#define _ADCCMPCON1_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON1_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON1_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON1_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON1_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON1_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON1_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON1_AINID_POSITION               0x00000008
#define _ADCCMPCON1_AINID_MASK                   0x00003F00
#define _ADCCMPCON1_AINID_LENGTH                 0x00000006

#define _ADCCMPCON1_CVDDATA_POSITION             0x00000010
#define _ADCCMPCON1_CVDDATA_MASK                 0xFFFF0000
#define _ADCCMPCON1_CVDDATA_LENGTH               0x00000010

#define _ADCCMPCON2_IELOLO_POSITION              0x00000000
#define _ADCCMPCON2_IELOLO_MASK                  0x00000001
#define _ADCCMPCON2_IELOLO_LENGTH                0x00000001

#define _ADCCMPCON2_IELOHI_POSITION              0x00000001
#define _ADCCMPCON2_IELOHI_MASK                  0x00000002
#define _ADCCMPCON2_IELOHI_LENGTH                0x00000001

#define _ADCCMPCON2_IEHILO_POSITION              0x00000002
#define _ADCCMPCON2_IEHILO_MASK                  0x00000004
#define _ADCCMPCON2_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON2_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON2_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON2_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON2_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON2_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON2_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON2_DCMPED_POSITION              0x00000005
#define _ADCCMPCON2_DCMPED_MASK                  0x00000020
#define _ADCCMPCON2_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON2_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON2_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON2_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON2_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON2_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON2_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON2_AINID_POSITION               0x00000008
#define _ADCCMPCON2_AINID_MASK                   0x00001F00
#define _ADCCMPCON2_AINID_LENGTH                 0x00000005

#define _ADCCMPCON3_IELOLO_POSITION              0x00000000
#define _ADCCMPCON3_IELOLO_MASK                  0x00000001
#define _ADCCMPCON3_IELOLO_LENGTH                0x00000001

#define _ADCCMPCON3_IELOHI_POSITION              0x00000001
#define _ADCCMPCON3_IELOHI_MASK                  0x00000002
#define _ADCCMPCON3_IELOHI_LENGTH                0x00000001

#define _ADCCMPCON3_IEHILO_POSITION              0x00000002
#define _ADCCMPCON3_IEHILO_MASK                  0x00000004
#define _ADCCMPCON3_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON3_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON3_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON3_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON3_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON3_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON3_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON3_DCMPED_POSITION              0x00000005
#define _ADCCMPCON3_DCMPED_MASK                  0x00000020
#define _ADCCMPCON3_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON3_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON3_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON3_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON3_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON3_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON3_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON3_AINID_POSITION               0x00000008
#define _ADCCMPCON3_AINID_MASK                   0x00001F00
#define _ADCCMPCON3_AINID_LENGTH                 0x00000005

#define _ADCCMPCON4_IELOLO_POSITION              0x00000000
#define _ADCCMPCON4_IELOLO_MASK                  0x00000001
#define _ADCCMPCON4_IELOLO_LENGTH                0x00000001

#define _ADCCMPCON4_IELOHI_POSITION              0x00000001
#define _ADCCMPCON4_IELOHI_MASK                  0x00000002
#define _ADCCMPCON4_IELOHI_LENGTH                0x00000001

#define _ADCCMPCON4_IEHILO_POSITION              0x00000002
#define _ADCCMPCON4_IEHILO_MASK                  0x00000004
#define _ADCCMPCON4_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON4_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON4_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON4_IEHIHI_LENGTH                0x00000001

